// eslint-disable-next-line @typescript-eslint/no-unused-vars
import React from "react";

import PageTemplate from "../../components/PageTemplate/PageTemplate";
import bg from "./bg.jpg";

const Split: React.FC = () => {
  // eslint-disable-next-line @typescript-eslint/no-unused-vars
  const text =
    "𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪 𝔩𝔬𝔯𝔢𝔪 𝔦𝔭𝔰𝔲𝔪";
  return (
    <PageTemplate
      title="Splitting"
      subtitles={[
        "React sends all the code bundle in advance.",
        "We can spilt different areas of our code to reduce the bundle size",
      ]}
    >
      <img src={bg} alt="bg" width="100%" />
    </PageTemplate>
  );
};

export default Split;
